Revit 2026 API

# LoadCombinationSetUsageIds Method

---
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetUsageIds(
	IList<ElementId> usageIds
)
```
```vb
Public Sub SetUsageIds (
	usageIds As IList(Of ElementId)
)
```
```cpp
public:
void SetUsageIds(
	IList<ElementId^>^ usageIds
)
```
```fsharp
member SetUsageIds :
        usageIds : IList<ElementId> -> unit
```

#### Parameters

usageIds IListElementId

#### Reference

LoadCombination Class

Autodesk.Revit.DB.Structure Namespace